package chapter07;

// Демонстрация выполнения конструкторов.

// Создать суперкласс.
class A {
    A() {
        System.out.println("Конструктор A.");
    }
}
