package chapter07;

// Создать подкласс путем расширения класса A.
class B extends A {
    B() {
        System.out.println("Конструктор B.");
    }
}
