package chapter07;

// Создать еще один подкласс путем расширения класса B.
class C extends B {
    C() {
        System.out.println("Конструктор C.");
    }
}
